In [43]:
import pandas as pd
#cria um DataFrame
data = {'Empresa': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Nome':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Venda': [200, 120, 340, 124, 243, 350]}

In [44]:
data

{'Empresa': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Venda': [200, 120, 340, 124, 243, 350]}

In [45]:
df = pd.DataFrame(data)

In [46]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [47]:
df.groupby('Empresa')

group = df.groupby('Empresa')

In [48]:
group

In [49]:
group.sum() #soma das vendas

         Venda
Nome
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

In [31]:
group.describe() #aponta uma serie de metodos  pre definidos

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [50]:
group.min() # os valores minimos

        Empresa  Venda
Nome
Amy        MSFT    340
Carl         FB    243
Charlie    GOOG    120
Sam        GOOG    200
Sarah        FB    350
Vanessa    MSFT    124

In [51]:
group.count() #conta a quantidade de valores

         Empresa  Venda
Nome
Amy            1      1
Carl           1      1
Charlie        1      1
Sam            1      1
Sarah          1      1
Vanessa        1      1

In [52]:
group = df.groupby('Nome')

group.sum()

In [54]:
group.sum().loc['Amy'] #localizar e criar agrupamento por nome e venda mais alta

Venda    340
Name: Amy, dtype: int64